# 2_1_while.py

# 퀴즈
# 아래 숫자들의 규칙을 숫자 3개로 표현하세요
# 0 1 2 3 4     0, 5, 1
# 0 2 4 6 8     0, 10, 2
# 4 3 2 1 0     5-1, -1, -1

i = 0           # 시작
while i < 5:    # 종료
    i += 1      # 증감

# 퀴즈
# 0 ~ 9까지의 정수를 거꾸로 출력하세요
i = 9
while i >= 0:
    print(i, end=" ")
    i -= 1
print()

# 퀴즈
# 0 ~ 24 사이의 정수를 출력하세요 (한 줄에 5개씩, 2가지 코드)
#  0  1  2  3  4
#  5  6  7  8  9
# 10 11 12 13 14
# 15 16 17 18 19
# 20 21 22 23 24

print("0  1  2  3  4")
print("5  6  7  8  9")
print("10 11 12 13 14")
print("15 16 17 18 19")
print("20 21 22 23 24")

i = 0
while i < 25:
    print(i, i+1, i+2, i+3, i+4)
    i += 5
print()

i = 0
while i < 5:
    print(i*5, i*5+1, i*5+2, i*5+3, i*5+4)
    i += 1
print()

i = 0
n = 0
while i < 25:
    print(i, end=" ")

    if n % 5 == 4:
        print()
        n = -1

    i += 1
    n += 1
print()

i = 0
while i < 25:
    print(i, end=" ")

    # if i == 4 or i == 9 or i == 14 or i == 19 or i == 24:
    # if i % 10 == 4 or i % 10 == 9:
    if i % 5 == 4:
        print()

    i += 1
print()

# 0 1 2 3 4
# 5 6 7 8 9
# 10 11 12 13 14
# 15 16 17 18 19
# 20 21 22 23 24





