# hello, python!!을 3번 출력하는 코드를 만드세요 (3가지)

# hello 주변에 작은 따옴표와 큰 따옴표를 출력하세요

# a와 b의 값을 교환하세요

# 0 ~ 999 사이의 양수의 자릿수 합계를 알려주세요

# 양수의 자릿수 합계를 구하세요

# 입력한 양수보다 크거나 같은 첫 번째 5의 배수를 구하세요

# age가 10대인지 알려주세요

# 어떤 양수가 홀수인지 짝수인지 알려주세요

# 어떤 양수가 3의 배수인지 5의 배수인지 3과 5의 배수가 아닌지 알려주세요
# (15, 30, 45, ... 입력 금지)

# 2개의 정수로부터 큰 값을 찾는 함수를 만드세요

# 4개의 정수로부터 큰 값을 찾는 함수를 만드세요 (2가지 코드)

# max_4를 max_2를 사용해서 만드세요 (2가지 코드)

# 0 ~ 9까지의 정수를 거꾸로 출력하세요

# 0 ~ 24 사이의 정수를 출력하세요 (한 줄에 5개씩, 2가지 코드)

# 0 ~ 99 사이의 난수 10개가 들어있는 리스트를 만드세요

# 리스트를 거꾸로 출력하세요

# 리스트에서 마지막 요소를 삭제하세요

# 난수 리스트의 합계를 구하세요
# 난수 리스트에 들어있는 홀수 합계와 짝수 합계를 구하세요

db = """3412    [|Bob|] 123
3834  Jonny 333
1248   Kate 634
1423   Tony 567
2567  Peter 435
3567  Alice 535
1548  Kerry 534"""

# 직원 이름들을 찾아주세요

# T로 시작하는 이름만 찾아보세요

# T로 시작하지 않는 이름만 찾아보세요

# 흥덕 도서관 노트북실의 빈 좌석 갯수를 알려주세요

# 흥덕 도서관 노트북실의 빈 좌석 번호를 알려주세요

# 리스트에서 중복된 값들을 모두 삭제하세요

# 딕셔너리의 items 함수를 for문에 적용하세요
d = {'name': 'kim', 'age': 21}

# 기상청 데이터를 수신해서 지역 이름과 코드만 예쁘게 출력하세요
url = "http://www.kma.go.kr/DFSROOT/POINT/DATA/top.json.txt"

# 기상청 데이터를 정규표현식을 사용해서 json에서 했던 것처럼 예쁘게 출력하세요

# 리스트의 앞쪽 절반만 출력하세요 (슬라이싱)

# 리스트의 뒤쪽 절반만 출력하세요 (슬라이싱)

# 리스트의 짝수 번째만 출력하세요 (슬라이싱)

# 리스트의 홀수 번째만 출력하세요 (슬라이싱)

# 리스트를 거꾸로 출력하세요 (슬라이싱)

# 100보다 작은 난수 10개로 리스트를 만드세요 (컴프리헨션)

# 리스트에서 홀수만 뽑아서 새로운 리스트를 만드세요 (컴프리헨션)

# data 폴더에서 poem.txt 파일을 읽고 개행문자의 갯수를 알려주세요 (컴프리헨션)

# 기상청 아래 주소로부터 데이터를 가져와서 파싱, 출력하세요
url = "http://www.kma.go.kr/weather/forecast/mid-term-rss3.jsp?stnId=108"

# province와 city를 한번에 검색하세요

# mode, tmEf, wf, tmn, tmx, rnSt를 한번에 검색하세요

# 파싱한 내용을 파일로 저장하세요 (weather.csv)

# weather.csv 파일을 읽어서 예쁘게 출력하세요

# weather.csv 파일을 읽어서 예쁘게 출력하세요 (csv 사용)

# 문자열 리스트를 내림차순으로 정렬하세요
colors = ["red", "green", "blue", "WHITE", "YELLOW"]

# 문자열 리스트를 알파벳 순서로 정렬하세요

# 문자열 리스트를 길이 순서로 정렬하세요

# 컴프리헨션을 사용해서 100보다 작은 2차원 난수 리스트를 만드세요

# 2차원 리스트를 출력하세요 (반복문을 2개 사용합니다)

# 2차원 리스트에 들어있는 int 갯수를 알려주세요

# 2차원 리스트에서 가장 큰 숫자를 찾아보세요

# 2차원 리스트에서 홀수 합계를 구하세요

print(__name__)
